Revit 2027 API
PerformanceAdviser.GetElementFilterFromRule(PerformanceAdviserRuleId, Document) Method
 Retrieves a filter to restrict elements to be checked.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementFilter GetElementFilterFromRule(
	PerformanceAdviserRuleId id,
	Document document
)
Public Function GetElementFilterFromRule (
	id As PerformanceAdviserRuleId,
	document As Document
) As ElementFilter
public:
ElementFilter^ GetElementFilterFromRule(
	PerformanceAdviserRuleId^ id,
	Document^ document
)
member GetElementFilterFromRule :
        id : PerformanceAdviserRuleId *
        document : Document -> ElementFilter
Parameters
id PerformanceAdviserRuleId
 The rule id to get information for.
document Document
 Document for which performance problems are being checked.
Return Value
ElementFilter
 The filter to restrict elements to be checked.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PerformanceAdviser Class
GetElementFilterFromRule Overload
Autodesk.Revit.DB Namespace